blog/32.org
#+options: html-link-use-abs-url:nil html-postamble:t
#+options: html-preamble:t html-scripts:nil html-style:t
#+options: html5-fancy:nil tex:t toc:nil num:nil
#+html_doctype: xhtml-strict
#+html_container: div
#+html_content_class: content
#+description:
#+keywords:
#+html_link_home:
#+html_link_up:
#+html_mathjax:
#+html_equation_reference_format: \eqref{%s}
#+html_head: <link rel="stylesheet" type="text/css" href="./style.css"/>
#+html_head_extra:
#+title: SICP 4.1.3 Evaluator Data Structure
#+subtitle: 2024-06-25 Tue
#+infojs_opt:
#+creator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)

Authors presents further elements of the evaluator implementation: the
data structures internally manipulated by the evaluator. Some are
needed to represent procedures, environments, the true and the false.

** Testing of predicates
Only the ~false~ object represents falsity.

#+begin_src scheme
  (define (true? x)
    (not (eq? x false)))

  (define (false? x)
    (eq? x false))
#+end_src

** Representing procedures
We assume we have the ~apply-primitive-procedure~ (which takes a
primitive procedure and its arguments) and the ~primitive-procedure~
procedures available. They do what you expect them to do.

~Make-procedure~ is used to make compound procedures. It is applied to
some parameters, a body, and an environment.

#+begin_src scheme
  (define (make-procedure parameters body env)
    (list 'procedure parameters body env))

  (define (compound-procedure? p)
    (tagged-list? p 'procedure))

  (define (procedure-parameters p) (cadr p))

  (define (procedure-body p) (caddr p))

  (define (procedure-environment p) (cadddr p))

#+end_src

** Operations on Environments
An environment, as we already know, is a sequence of frames, each of
which is made of bindings (associations of a variable to a value). To
manipulate frames we use the ~lookup-variable-value~, the
~extend-environment~, the ~define-variable!~, and the
~set-variable-value!~ procedures.

Environment are represented as a list of frames. The enclosing
environment is the ~cdr~ of the list. Frames are represented as pair
of lists, the first one of which is the list of variables, and the
second one of which is the list of values. Note that such a
representation of the environments is not a production-quality one.

#+begin_src scheme
  (define (enclosing-environment env) (cdr env))

  (define (first-frame env) (car env))

  (define the-empty-environment '())
#+end_src

#+begin_src scheme
  (define (make-frame variables values)
    (cons variables values))

  (define (frame-variables frame) (car frame))

  (define (frame-values frame) (cdr frame))

  (define (add-binding-to-frame! var val frame)
    (set-car! frame (cons var (car frame)))
    (set-cdr! frame (cons val (cdr frame))))
#+end_src

#+begin_src scheme
  (define (extend-environment vars vals base-env)
    (if (= (length vars) (length vals))
        (cons (make-frame vars vals) base-env)
        (if (< (length vars) (length vals))
            (error "Too many arguments supplied" vars vals)
            (error "Too few arguments supplied" vars vals))))
#+end_src

#+begin_src scheme
  (define (lookup-variable-value var env)
    (define (env-loop env)
      (define (scan vars vals)
        (cond ((null? vars)
               (env-loop (enclosing-environment env)))
              ((eq? var (car vars))
               (car vals))
              (else (scan (cdr vars) (cdr vals)))))
      (if (eq? env the-empty-environment)
          (error "Unbound variable" var)
          (let ((frame (first-frame env)))
            (scan (frame-variables frame)
                  (frame-values frame)))))
    (env-loop env))
#+end_src

#+begin_src scheme
  (define (set-variable-value! var val env)
    (define (env-loop env)
      (define (scan vars vals)
        (cond ((null? vars)
               (env-loop (enclosing-environment env)))
              ((eq? var (car vars))
               (set-car! vals val))
              (else (scan (cdr vars) (cdr vals)))))
      (if (eq? env the-empty-environment)
          (error "Unbound variable -- SET!" var)
          (let ((frame (first-frame env)))
            (scan (frame-variables frame)
                  (frame-values frame)))))
    (env-loop env))
#+end_src

#+begin_src scheme
  (define (define-variable! var val env)
    (let ((frame (first-frame env)))
      (define (scan vars vals)
        (cond ((null? vars)
               (add-binding-to-frame! var val frame))
              ((eq? var (car vars))
               (set-car! vals val))
              (else (scan (cdr vars) (cdr vals)))))
      (scan (frame-variables frame)
            (frame-values frame))))
#+end_src

