blog/32.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-25 Tue 00:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SICP 4.1.3 Evaluator Data Structure</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./style.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">SICP 4.1.3 Evaluator Data Structure
<br />
<span class="subtitle">2024-06-25 Tue</span>
</h1>
<p>
Authors presents further elements of the evaluator implementation: the
data structures internally manipulated by the evaluator. Some are
needed to represent procedures, environments, the true and the false.
</p>

<div id="outline-container-orga48cbdb" class="outline-2">
<h2 id="orga48cbdb">Testing of predicates</h2>
<div class="outline-text-2" id="text-orga48cbdb">
<p>
Only the <code>false</code> object represents falsity.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">true?</span> x)
  (not (eq? x false)))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">false?</span> x)
  (eq? x false))
</pre>
</div>
</div>
</div>

<div id="outline-container-org003e6ee" class="outline-2">
<h2 id="org003e6ee">Representing procedures</h2>
<div class="outline-text-2" id="text-org003e6ee">
<p>
We assume we have the <code>apply-primitive-procedure</code> (which takes a
primitive procedure and its arguments) and the <code>primitive-procedure</code>
procedures available. They do what you expect them to do.
</p>

<p>
<code>Make-procedure</code> is used to make compound procedures. It is applied to
some parameters, a body, and an environment.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-procedure</span> parameters body env)
  (list 'procedure parameters body env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">compound-procedure?</span> p)
  (tagged-list? p 'procedure))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-parameters</span> p) (cadr p))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-body</span> p) (caddr p))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">procedure-environment</span> p) (cadddr p))

</pre>
</div>
</div>
</div>

<div id="outline-container-org4d80478" class="outline-2">
<h2 id="org4d80478">Operations on Environments</h2>
<div class="outline-text-2" id="text-org4d80478">
<p>
An environment, as we already know, is a sequence of frames, each of
which is made of bindings (associations of a variable to a value). To
manipulate frames we use the <code>lookup-variable-value</code>, the
<code>extend-environment</code>, the <code>define-variable!</code>, and the
<code>set-variable-value!</code> procedures.
</p>

<p>
Environment are represented as a list of frames. The enclosing
environment is the <code>cdr</code> of the list. Frames are represented as pair
of lists, the first one of which is the list of variables, and the
second one of which is the list of values. Note that such a
representation of the environments is not a production-quality one.
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">enclosing-environment</span> env) (cdr env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-frame</span> env) (car env))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">the-empty-environment</span> '())
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-frame</span> variables values)
  (cons variables values))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">frame-variables</span> frame) (car frame))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">frame-values</span> frame) (cdr frame))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">add-binding-to-frame!</span> var val frame)
  (set-car! frame (cons var (car frame)))
  (set-cdr! frame (cons val (cdr frame))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">extend-environment</span> vars vals base-env)
  (<span style="color: #531ab6;">if</span> (= (length vars) (length vals))
      (cons (make-frame vars vals) base-env)
      (<span style="color: #531ab6;">if</span> (&lt; (length vars) (length vals))
          (error <span style="color: #3548cf;">"Too many arguments supplied"</span> vars vals)
          (error <span style="color: #3548cf;">"Too few arguments supplied"</span> vars vals))))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-variable-value</span> var env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (env-loop (enclosing-environment env)))
            ((eq? var (car vars))
             (car vals))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable"</span> var)
        (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
          (scan (frame-variables frame)
                (frame-values frame)))))
  (env-loop env))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-variable-value!</span> var val env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (env-loop (enclosing-environment env)))
            ((eq? var (car vars))
             (set-car! vals val))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable -- SET!"</span> var)
        (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
          (scan (frame-variables frame)
                (frame-values frame)))))
  (env-loop env))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">define-variable!</span> var val env)
  (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (add-binding-to-frame! var val frame))
            ((eq? var (car vars))
             (set-car! vals val))
            (<span style="color: #531ab6;">else</span> (scan (cdr vars) (cdr vals)))))
    (scan (frame-variables frame)
          (frame-values frame))))
</pre>
</div>
</div>
</div>
