blog/32.org
** Exercise 4.11
*Exercise*:

#+begin_quote
Instead of representing a frame as a pair of lists, we can represent a
frame as a list of bindings, where each binding is a name-value pair.
Rewrite the environment operations to use this alternative
representation.
#+end_quote

*Answer*:

These are the operations presented by Authors:
#+begin_src scheme
  (lookup-variable-value <VAR> <ENV>)
  (extend-environment <VARIABLES> <VALUES> <BASE-ENV>)
  (define-variable! <VAR> <VALUE> <ENV>)
  (set-variable-value! <VAR> <VALUE> <ENV>)
#+end_src

~Enclosing-environment~, ~first-frame~, and ~the-empty-environment~
can remain the way they are. For an environment remains a list of
frames.

~Make-frame~, instead, has to change:
#+begin_src scheme
  (define (make-frame variable values)
    (if (null? variable) ;; assumes variable and values have the same length
        nil
        (cons (cons (car variable) (car values))
              (make-frame (cdr variable) (cdr values)))))
#+end_src

We need a way to add a binding to a frame. Here is one way of doing
it:
#+begin_src scheme
  (define (add-binding-to-frame! var val frame)
    (set-car! frame (cons var val))
    (set-cdr! frame (cons (car frame) (cdr frame))))
#+end_src

~Extend-environment~ can be left the way it is:
#+begin_src scheme
  (define (extend-environment vars vals base-env)
    (if (= (length vars) (length vals))
        (cons (make-frame vars vals) base-env)
        (if (< (length vars) (length vals))
            (error "Too many arguments supplied" vars vals)
            (error "Too few arguments supplied" vars vals))))
#+end_src

Here is ~lookup-variable-value~:
#+begin_src scheme
  (define (lookup-variable-value var env)
    (define (env-loop env)
      (define (scan frame)
        (cond ((null? frame)
               (env-loop (enclosing-environment env)))
              ((eq? var (caar frame))
               (cdar frame))
              (else (scan (cdr frame)))))
      (if (eq? env the-empty-environment)
          (error "Unbound variable" var)
          (scan (first-frame env))))
    (env-loop env))
#+end_src

Example:
#+begin_src scheme
  (let ((gp-env (list (make-frame '(foo bar baz) '(1 2 3))
                      (make-frame '(foobaz) '(4))
                      (make-frame '(x y z) '(5 6 7)))))
    (lookup-variable-value 'foobaz gp-env))
  ;; => 4
#+end_src

Here is ~set-variable-value!~:
#+begin_src scheme
  (define (set-variable-value! var val env)
    (define (env-loop env)
      (define (scan frame)
        (cond ((null? frame)
               (env-loop (enclosing-environment env)))
              ((eq? var (caar frame))
               (set-cdr! (car frame) val))
              (else (scan (cdr frame)))))
      (if (eq? env the-empty-environment)
          (error "Unbound variable -- SET!" var)
          (scan (first-frame env))))
    (env-loop env))
#+end_src

Example:
#+begin_src scheme
  (let ((gp-env (list (make-frame '(foo bar baz) '(1 2 3))
                      (make-frame '(foobaz) '(4))
                      (make-frame '(x y z) '(5 6 7)))))
    (set-variable-value! 'foobaz 'FOOBAZ gp-env)
    (lookup-variable-value 'foobaz gp-env))
#+end_src

~Define-variable!~ was a bit more problematic.

First of all let's notice that Authors' version assumes that the
enviroment is not empty. We will assume that too.

The main problem I had was this: if a frame is an empty list (because
there are no bindings), then ~add-binding-to-frame!~ won't work. For
neither ~set-car!~ nor ~set-cdr!~ can be applied to an empty list. So,
my solution assumes that we have established the convention that an
empty frame is a list with an empty list in it.

This is an empty frame:
#+begin_src scheme
'(())
#+end_src

And this is an environment with an empty frame:
#+begin_src scheme
'((()))
#+end_src

Given this, here is ~define-variable!~:
#+begin_src scheme
  (define (define-variable! var val env)
    (let ((frame (first-frame env)))
      (define (scan frame)
        (cond ((null? (car frame))
               (set-car! frame (cons var val)))
              ((eq? var (caar frame))
               (set-car! frame (cons var val)))
              (else
               (if (null? (cdr frame))
                   (begin
                     (set-car! frame '())
                     (scan frame))
                   (scan (cdr frame))))))
      (scan frame)))
#+end_src

