blog/32.html

<div id="outline-container-org7a4fb59" class="outline-2">
<h2 id="org7a4fb59">Exercise 4.11</h2>
<div class="outline-text-2" id="text-org7a4fb59">
<p>
<b>Exercise</b>:
</p>

<blockquote>
<p>
Instead of representing a frame as a pair of lists, we can represent a
frame as a list of bindings, where each binding is a name-value pair.
Rewrite the environment operations to use this alternative
representation.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
These are the operations presented by Authors:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(lookup-variable-value <span style="color: #005f5f;">&lt;VAR&gt;</span> <span style="color: #005f5f;">&lt;ENV&gt;</span>)
(extend-environment <span style="color: #005f5f;">&lt;VARIABLES&gt;</span> <span style="color: #005f5f;">&lt;VALUES&gt;</span> <span style="color: #005f5f;">&lt;BASE-ENV&gt;</span>)
(define-variable! <span style="color: #005f5f;">&lt;VAR&gt;</span> <span style="color: #005f5f;">&lt;VALUE&gt;</span> <span style="color: #005f5f;">&lt;ENV&gt;</span>)
(set-variable-value! <span style="color: #005f5f;">&lt;VAR&gt;</span> <span style="color: #005f5f;">&lt;VALUE&gt;</span> <span style="color: #005f5f;">&lt;ENV&gt;</span>)
</pre>
</div>

<p>
<code>Enclosing-environment</code>, <code>first-frame</code>, and <code>the-empty-environment</code>
can remain the way they are. For an environment remains a list of
frames.
</p>

<p>
<code>Make-frame</code>, instead, has to change:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">make-frame</span> variable values)
  (<span style="color: #531ab6;">if</span> (null? variable) <span style="color: #595959;">;; </span><span style="color: #595959;">assumes variable and values have the same length</span>
      nil
      (cons (cons (car variable) (car values))
            (make-frame (cdr variable) (cdr values)))))
</pre>
</div>

<p>
We need a way to add a binding to a frame. Here is one way of doing
it:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">add-binding-to-frame!</span> var val frame)
  (set-car! frame (cons var val))
  (set-cdr! frame (cons (car frame) (cdr frame))))
</pre>
</div>

<p>
<code>Extend-environment</code> can be left the way it is:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">extend-environment</span> vars vals base-env)
  (<span style="color: #531ab6;">if</span> (= (length vars) (length vals))
      (cons (make-frame vars vals) base-env)
      (<span style="color: #531ab6;">if</span> (&lt; (length vars) (length vals))
          (error <span style="color: #3548cf;">"Too many arguments supplied"</span> vars vals)
          (error <span style="color: #3548cf;">"Too few arguments supplied"</span> vars vals))))
</pre>
</div>

<p>
Here is <code>lookup-variable-value</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-variable-value</span> var env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> frame)
      (<span style="color: #531ab6;">cond</span> ((null? frame)
             (env-loop (enclosing-environment env)))
            ((eq? var (caar frame))
             (cdar frame))
            (<span style="color: #531ab6;">else</span> (scan (cdr frame)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable"</span> var)
        (scan (first-frame env))))
  (env-loop env))
</pre>
</div>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">let</span> ((gp-env (list (make-frame '(foo bar baz) '(1 2 3))
                    (make-frame '(foobaz) '(4))
                    (make-frame '(x y z) '(5 6 7)))))
  (lookup-variable-value 'foobaz gp-env))
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; 4</span>
</pre>
</div>

<p>
Here is <code>set-variable-value!</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-variable-value!</span> var val env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> frame)
      (<span style="color: #531ab6;">cond</span> ((null? frame)
             (env-loop (enclosing-environment env)))
            ((eq? var (caar frame))
             (set-cdr! (car frame) val))
            (<span style="color: #531ab6;">else</span> (scan (cdr frame)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable -- SET!"</span> var)
        (scan (first-frame env))))
  (env-loop env))
</pre>
</div>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">let</span> ((gp-env (list (make-frame '(foo bar baz) '(1 2 3))
                    (make-frame '(foobaz) '(4))
                    (make-frame '(x y z) '(5 6 7)))))
  (set-variable-value! 'foobaz 'FOOBAZ gp-env)
  (lookup-variable-value 'foobaz gp-env))
</pre>
</div>

<p>
<code>Define-variable!</code> was a bit more problematic.
</p>

<p>
First of all let's notice that Authors' version assumes that the
enviroment is not empty. We will assume that too.
</p>

<p>
The main problem I had was this: if a frame is an empty list (because
there are no bindings), then <code>add-binding-to-frame!</code> won't work. For
neither <code>set-car!</code> nor <code>set-cdr!</code> can be applied to an empty list. So,
my solution assumes that we have established the convention that an
empty frame is a list with an empty list in it.
</p>

<p>
This is an empty frame:
</p>
<div class="org-src-container">
<pre class="src src-scheme">'(())
</pre>
</div>

<p>
And this is an environment with an empty frame:
</p>
<div class="org-src-container">
<pre class="src src-scheme">'((()))
</pre>
</div>

<p>
Given this, here is <code>define-variable!</code>:
</p>
<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">define-variable!</span> var val env)
  (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> frame)
      (<span style="color: #531ab6;">cond</span> ((null? (car frame))
             (set-car! frame (cons var val)))
            ((eq? var (caar frame))
             (set-car! frame (cons var val)))
            (<span style="color: #531ab6;">else</span>
             (<span style="color: #531ab6;">if</span> (null? (cdr frame))
                 (<span style="color: #531ab6;">begin</span>
                   (set-car! frame '())
                   (scan frame))
                 (scan (cdr frame))))))
    (scan frame)))
</pre>
</div>
</div>
</div>
