blog/32.org
** Exercise 4.12
*Exercise*:
#+begin_quote
The procedures ~set-variable-value!~, ~define-variable!~, and
~lookup-variable-value~ can be expressed in terms of more abstract
procedures for traversing the environment structure.  Define
abstractions that capture the common patterns and redefine the three
procedures in terms of these abstractions.
#+end_quote

*Answer*:

#+begin_src scheme
  (define (rest-of-vars vars)
    (cdr vars))
  (define (rest-of-vals vals)
    (cdr vals))
  (define (set-first-value! vals val)
    (set-car! vals val))
  (define (first-var  vars)
    (car vars))

  (define (set-variable-value! var val env)
    (define (env-loop env)
      (define (scan vars vals)
        (cond ((null? vars)
               (env-loop (enclosing-environment env)))
              ((eq? var (first-var vars))
               (set-first-value! vals val))
              (else (scan (rest-of-vars vars) (rest-of-vals vals)))))
      (if (eq? env the-empty-environment)
          (error "Unbound variable -- SET!" var)
          (let ((frame (first-frame env)))
            (scan (frame-variables frame)
                  (frame-values frame)))))
    (env-loop env))

  (define (lookup-variable-value var env)
    (define (env-loop env)
      (define (scan vars vals)
        (cond ((null? vars)
               (env-loop (enclosing-environment env)))
              ((eq? var (first-var vars))
               (car vals))
              (else (scan (rest-of-vars vars) (rest-of-vals vals)))))
      (if (eq? env the-empty-environment)
          (error "Unbound variable" var)
          (let ((frame (first-frame env)))
            (scan (frame-variables frame)
                  (frame-values frame)))))
    (env-loop env))

  (define (define-variable! var val env)
    (let ((frame (first-frame env)))
      (define (scan vars vals)
        (cond ((null? vars)
               (add-binding-to-frame! var val frame))
              ((eq? var (first-var vars))
               (set-first-value! vals val))
              (else (scan (rest-of-vars vars) (rest-of-vals vals)))))
      (scan (frame-variables frame)
            (frame-values frame))))
#+end_src

** Exercise 4.13
*Exercise*:
#+begin_quote
Scheme allows us to create new bindings for variables by means of
~define~, but provides no way to get rid of bindings.  Implement for
the evaluator a special form ~make-unbound!~ that removes the binding
of a given symbol from the environment in which the ~make-unbound!~
expression is evaluated.  This problem is not completely specified.
For example, should we remove only the binding in the first frame of
the environment?  Complete the specification and justify any choices
you make.
#+end_quote

*Answer*:

I think we should remove the binding in the first frame only. If we
did otherwise, then couldn't we mutate frames other parts of the
program rely on?

Given that, as far as I know, we cannot /mutate/ a list with one
member into an empty list, I'm using an iterative-process-evolving
~filter-frame~ procedure which /construct/ a new list (well two new
lists, ~new-vars~ and ~new-vals~) and then I set the ~car~ of the
environment to the new relevant list (that is, I replace the first
frame with a new one). I could have used a recursive-process-evolving
procedure as opposed to an iterative-process-evolving one (see Chapter
1 if you forgot the distinction).

#+begin_src scheme
  (define (append l1 l2)
    (if (null? l1)
        l2
        (cons (car l1) (append (cdr l1) l2))))

  ;; Usage:
  ;; (make-unbound! 'foo)

  (define (var-to-unbind exp)
    (cadr exp))

  (define (eval-make-unbound exp env)
    (define (filter-frame vars vals var new-vars new-vals)
      (cond ((null? vars)
             (set-car! env (cons new-vars new-vals)))
            ((eq? (car vars) var)
             (filter-frame nil
                           nil
                           var
                           (append (cdr vars) new-vars)
                           (append (cdr vals) new-vals)))
            (else (filter-frame (cdr vars)
                                (cdr vals)
                                var
                                (append (list (car vars)) new-vars)
                                (append (list (car vals)) new-vals)))))
    (filter-frame (frame-variables (first-frame env))
                  (frame-values (first-frame env))
                  (var-to-unbind exp)
                  nil
                  nil))

  (define gp-env '(((a b c) 1 2 3) ((d e f) 4 5 6)))
  (eval-make-unbound '(make-unbound b) gp-env)
  gp-env
  ;; => (((c a) 3 1) ((d e f) 4 5 6))
#+end_src
