blog/32.html

<div id="outline-container-org3452f3f" class="outline-2">
<h2 id="org3452f3f">Exercise 4.12</h2>
<div class="outline-text-2" id="text-org3452f3f">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
The procedures <code>set-variable-value!</code>, <code>define-variable!</code>, and
<code>lookup-variable-value</code> can be expressed in terms of more abstract
procedures for traversing the environment structure.  Define
abstractions that capture the common patterns and redefine the three
procedures in terms of these abstractions.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rest-of-vars</span> vars)
  (cdr vars))
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">rest-of-vals</span> vals)
  (cdr vals))
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-first-value!</span> vals val)
  (set-car! vals val))
(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">first-var</span>  vars)
  (car vars))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">set-variable-value!</span> var val env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (env-loop (enclosing-environment env)))
            ((eq? var (first-var vars))
             (set-first-value! vals val))
            (<span style="color: #531ab6;">else</span> (scan (rest-of-vars vars) (rest-of-vals vals)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable -- SET!"</span> var)
        (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
          (scan (frame-variables frame)
                (frame-values frame)))))
  (env-loop env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">lookup-variable-value</span> var env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">env-loop</span> env)
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (env-loop (enclosing-environment env)))
            ((eq? var (first-var vars))
             (car vals))
            (<span style="color: #531ab6;">else</span> (scan (rest-of-vars vars) (rest-of-vals vals)))))
    (<span style="color: #531ab6;">if</span> (eq? env the-empty-environment)
        (error <span style="color: #3548cf;">"Unbound variable"</span> var)
        (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
          (scan (frame-variables frame)
                (frame-values frame)))))
  (env-loop env))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">define-variable!</span> var val env)
  (<span style="color: #531ab6;">let</span> ((frame (first-frame env)))
    (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">scan</span> vars vals)
      (<span style="color: #531ab6;">cond</span> ((null? vars)
             (add-binding-to-frame! var val frame))
            ((eq? var (first-var vars))
             (set-first-value! vals val))
            (<span style="color: #531ab6;">else</span> (scan (rest-of-vars vars) (rest-of-vals vals)))))
    (scan (frame-variables frame)
          (frame-values frame))))
</pre>
</div>
</div>
</div>

<div id="outline-container-org89f5ab1" class="outline-2">
<h2 id="org89f5ab1">Exercise 4.13</h2>
<div class="outline-text-2" id="text-org89f5ab1">
<p>
<b>Exercise</b>:
</p>
<blockquote>
<p>
Scheme allows us to create new bindings for variables by means of
<code>define</code>, but provides no way to get rid of bindings.  Implement for
the evaluator a special form <code>make-unbound!</code> that removes the binding
of a given symbol from the environment in which the <code>make-unbound!</code>
expression is evaluated.  This problem is not completely specified.
For example, should we remove only the binding in the first frame of
the environment?  Complete the specification and justify any choices
you make.
</p>
</blockquote>

<p>
<b>Answer</b>:
</p>

<p>
I think we should remove the binding in the first frame only. If we
did otherwise, then couldn't we mutate frames other parts of the
program rely on?
</p>

<p>
Given that, as far as I know, we cannot <i>mutate</i> a list with one
member into an empty list, I'm using an iterative-process-evolving
<code>filter-frame</code> procedure which <i>construct</i> a new list (well two new
lists, <code>new-vars</code> and <code>new-vals</code>) and then I set the <code>car</code> of the
environment to the new relevant list (that is, I replace the first
frame with a new one). I could have used a recursive-process-evolving
procedure as opposed to an iterative-process-evolving one (see Chapter
1 if you forgot the distinction).
</p>

<div class="org-src-container">
<pre class="src src-scheme">(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">append</span> l1 l2)
  (<span style="color: #531ab6;">if</span> (null? l1)
      l2
      (cons (car l1) (append (cdr l1) l2))))

<span style="color: #595959;">;; </span><span style="color: #595959;">Usage:</span>
<span style="color: #595959;">;; </span><span style="color: #595959;">(make-unbound! 'foo)</span>

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">var-to-unbind</span> exp)
  (cadr exp))

(<span style="color: #531ab6;">define</span> (<span style="color: #721045;">eval-make-unbound</span> exp env)
  (<span style="color: #531ab6;">define</span> (<span style="color: #721045;">filter-frame</span> vars vals var new-vars new-vals)
    (<span style="color: #531ab6;">cond</span> ((null? vars)
           (set-car! env (cons new-vars new-vals)))
          ((eq? (car vars) var)
           (filter-frame nil
                         nil
                         var
                         (append (cdr vars) new-vars)
                         (append (cdr vals) new-vals)))
          (<span style="color: #531ab6;">else</span> (filter-frame (cdr vars)
                              (cdr vals)
                              var
                              (append (list (car vars)) new-vars)
                              (append (list (car vals)) new-vals)))))
  (filter-frame (frame-variables (first-frame env))
                (frame-values (first-frame env))
                (var-to-unbind exp)
                nil
                nil))

(<span style="color: #531ab6;">define</span> <span style="color: #721045;">gp-env</span> '(((a b c) 1 2 3) ((d e f) 4 5 6)))
(eval-make-unbound '(make-unbound b) gp-env)
gp-env
<span style="color: #595959;">;; </span><span style="color: #595959;">=&gt; (((c a) 3 1) ((d e f) 4 5 6))</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div style="text-align: center;"><a href="./posts.html">←</a></div><p>Send me an <a href="mailto:giulio.pietroiusti@gmail.com">email</a> for comments.</p> <p>Created with <span class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.3.50 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</span></p>
</div>
</body>
</html>
